energia/msp432e-core/system/source/ti/drivers/emac/EMACMSP432E4.c
/*
 * Copyright (c) 2017-2018 Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ======== EMACMSP432E4.c ========
 *  This driver currently supports only 1 EMACMSP432E4 port. In the future
 *  when multiple ports are required, this driver needs to move all the
 *  EMACMSP432E4_Data fields into the EMACMSP432E4_Object structure. The APIs
 *  need to get to the fields via the pvt_data field in the NETIF_DEVICE that
 *  is passed in. ROV must be changed to support the change also.
 *  The NETIF_DEVICE structure should go into the EMACMSP432E4_Object also.
 *
 *  These changes are not being done at this time because of the impact on
 *  the complexity of the code.
 */
#include <stdint.h>
#include <stdbool.h>
#include <string.h>

#include <ti/devices/msp432e4/inc/msp432.h>

#include <ti/devices/msp432e4/driverlib/emac.h>
#include <ti/devices/msp432e4/driverlib/flash.h>
#include <ti/devices/msp432e4/driverlib/gpio.h>
#include <ti/devices/msp432e4/driverlib/pin_map.h>
#include <ti/devices/msp432e4/driverlib/sysctl.h>

#include <ti/drivers/dpl/ClockP.h>
#include <ti/drivers/dpl/HwiP.h>

/* NDK pre-processor guard to avoid a POSIX dependency */
#define NDK_NOUSERAPIS 1

#include <ti/drivers/emac/EMACMSP432E4.h>
#include <ti/drivers/gpio/GPIOMSP432E4.h>
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerMSP432E4.h>

#include <ti/ndk/inc/stkmain.h>

/* Name of the device. */
#define ETHERNET_NAME "eth0"

#define PHY_PHYS_ADDR 1
#define NUM_RX_DESCRIPTORS 4
#define NUM_TX_DESCRIPTORS 4
#define EMAC_PHY_CONFIG         (EMAC_PHY_TYPE_INTERNAL |                     \
                                 EMAC_PHY_INT_MDIX_EN |                       \
                                 EMAC_PHY_AN_100B_T_FULL_DUPLEX)

/* The size of the CRC stored at the end of the received frames */
#define CRC_SIZE_BYTES 4

/* The receive descriptor buffer size must be a multiple of 4 bytes */
#define RX_BUFFER_SIZE_MULTIPLE 4

#define RX_BUFFER_SIZE_ROUNDUP(X) ((((X) + \
        (RX_BUFFER_SIZE_MULTIPLE - 1)) / RX_BUFFER_SIZE_MULTIPLE) * \
        RX_BUFFER_SIZE_MULTIPLE)

/*
 *  The buffer size for receive descriptors to allow for receipt of a maximum
 *  length Ethernet payload (ETH_MAX_PAYLOAD) allowing for:
 *
 *  - The CRC also being stored by the EMACMSP432E4 port
 *  - Rounding up the size to the multiple required by the EMACMSP432E4 port
 */
#define RX_BUFFER_SIZE RX_BUFFER_SIZE_ROUNDUP (ETH_MAX_PAYLOAD + CRC_SIZE_BYTES)

/*
 *  Helper struct holding a DMA descriptor and the pbuf it currently refers
 *  to.
 */
typedef struct {
    tEMACDMADescriptor Desc;
    PBM_Handle hPkt;
} tDescriptor;

typedef struct {
    tDescriptor *pDescriptors;
    uint32_t     ulNumDescs;
    uint32_t     ulWrite;
    uint32_t     ulRead;
} tDescriptorList;

/*
 * The struct is used to store the private data for the EMACMSP432E4 controller.
 */
typedef struct EMACMSP432E4_Data {
    STKEVENT_Handle  hEvent;
    PBMQ             PBMQ_tx;
    PBMQ             PBMQ_rx;
    uint32_t         rxCount;
    uint32_t         rxDropped;
    uint32_t         txSent;
    uint32_t         txDropped;
    uint32_t         abnormalInts;
    uint32_t         isrCount;
    uint32_t         linkUp;
    tDescriptorList *pTxDescList;
    tDescriptorList *pRxDescList;
    HwiP_Handle      hwi;
} EMACMSP432E4_Data;

/*
 * Global variable for this interface's private data.  Needed to allow
 * the interrupt handlers access to this information outside of the
 * context of the lwIP netif.
 */
static tDescriptor g_pTxDescriptors[NUM_TX_DESCRIPTORS];
static tDescriptor g_pRxDescriptors[NUM_RX_DESCRIPTORS];

static tDescriptorList g_TxDescList = {
    g_pTxDescriptors, NUM_TX_DESCRIPTORS, 0, 0
};

static tDescriptorList g_RxDescList = {
    g_pRxDescriptors, NUM_RX_DESCRIPTORS, 0, 0
};

/* Application is required to provide this variable */
extern const EMACMSP432E4_HWAttrs EMACMSP432E4_hwAttrs;

/* Only supporting one EMACMSP432E4 device */
static EMACMSP432E4_Data EMACMSP432E4_private;

/* Funtion prototypes */
static void EMACMSP432E4_handleRx();
static void EMACMSP432E4_processTransmitted();
static int EMACMSP432E4_initDMADescriptors(void);
static int EMACMSP432E4_emacStart(struct NETIF_DEVICE* ptr_net_device);
static int EMACMSP432E4_emacStop(struct NETIF_DEVICE* ptr_net_device);

/*
 *  ======== signalLinkChange ========
 *  Signal the stack based on linkUp parameter.
 */
static void signalLinkChange(STKEVENT_Handle hEvent, uint32_t linkUp,
        uint32_t flag)
{
    if (linkUp) {
        /* Signal the stack that the link is up */
        STKEVENT_signal(hEvent, STKEVENT_LINKUP, flag);
    }
    else {
        /* Signal the stack that the link is down */
        STKEVENT_signal(hEvent, STKEVENT_LINKDOWN, flag);
    }
}

