energia/msp432e-core/system/source/ti/drivers/emac/EMACMSP432E4.c
                /* Update internal statistic */
                EMACMSP432E4_private.rxCount++;

                /*
                 *  Notify NDK stack of pending Rx Ethernet packet and
                 *  that it was triggered by an external event.
                 */
                STKEVENT_signal(EMACMSP432E4_private.hEvent, STKEVENT_ETHERNET,
                        1);

                /* Prime the receive descriptor back up for future packets */
                EMACMSP432E4_primeRx(hPktNew,
                        &(pDescList->pDescriptors[pDescList->ulRead]));
            }
        }

        /* Move on to the next descriptor in the chain, taking care to wrap. */
        pDescList->ulRead++;
        if (pDescList->ulRead == pDescList->ulNumDescs) {
            pDescList->ulRead = 0;
        }
    }
}

/*
 *  ======== EMACMSP432E4_processPhyInterrupt ========
 */
static void EMACMSP432E4_processPhyInterrupt()
{
    uint16_t value;
    uint16_t status;
    uint32_t config;
    uint32_t mode;
    uint32_t rxMaxFrameSize;

    /*
     * Read the PHY interrupt status.  This clears all interrupt sources.
     * Note that we are only enabling sources in EPHY_MISR1 so we don't
     * read EPHY_MISR2.
     */
    value = EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_MISR1);

    /* Read the current PHY status. */
    status = EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_STS);

    /* Has the link status changed? */
    if (value & EPHY_MISR1_LINKSTAT) {
        /* Is link up or down now? */
        if (status & EPHY_STS_LINK) {
            EMACMSP432E4_private.linkUp = true;
        }
        else {
            EMACMSP432E4_private.linkUp = false;
        }
        /* Signal the stack for this link status change (from ISR) */
        signalLinkChange(EMACMSP432E4_private.hEvent,
                EMACMSP432E4_private.linkUp, 1);
    }

    /* Has the speed or duplex status changed? */
    if (value & (EPHY_MISR1_SPEED | EPHY_MISR1_SPEED | EPHY_MISR1_ANC)) {
        /* Get the current MAC configuration. */
        EMACConfigGet(EMAC0_BASE, (uint32_t *)&config, (uint32_t *)&mode,
                        (uint32_t *)&rxMaxFrameSize);

        /* What speed is the interface running at now? */
        if (status & EPHY_STS_SPEED) {
            /* 10Mbps is selected */
            config &= ~EMAC_CONFIG_100MBPS;
        }
        else {
            /* 100Mbps is selected */
            config |= EMAC_CONFIG_100MBPS;
        }

        /* Are we in full- or half-duplex mode? */
        if (status & EPHY_STS_DUPLEX) {
            /* Full duplex. */
            config |= EMAC_CONFIG_FULL_DUPLEX;
        }
        else {
            /* Half duplex. */
            config &= ~EMAC_CONFIG_FULL_DUPLEX;
        }

        /* Reconfigure the MAC */
        EMACConfigSet(EMAC0_BASE, config, mode, rxMaxFrameSize);
    }
}

/*
 *  ======== EMACMSP432E4_hwiIntFxn ========
 */
static void EMACMSP432E4_hwiIntFxn(uintptr_t callbacks)
{
    uint32_t status;

    /* Check link status */
    status = (EMACPHYRead(EMAC0_BASE, 0, EPHY_BMSR) & EPHY_BMSR_LINKSTAT);

    /* Signal the stack if link status changed */
    if (status != EMACMSP432E4_private.linkUp) {
        signalLinkChange(EMACMSP432E4_private.hEvent, status, 1);
    }

    /* Set the link status */
    EMACMSP432E4_private.linkUp = status;

    EMACMSP432E4_private.isrCount++;

    /* Read and Clear the interrupt. */
    status = EMACIntStatus(EMAC0_BASE, true);
    EMACIntClear(EMAC0_BASE, status);

    /*
     *  Disable the Ethernet interrupts.  Since the interrupts have not been
     *  handled, they are not asserted.  Once they are handled by the Ethernet
     *  interrupt, it will re-enable the interrupts.
     */
    EMACIntDisable(EMAC0_BASE, (EMAC_INT_RECEIVE | EMAC_INT_TRANSMIT |
                     EMAC_INT_TX_STOPPED | EMAC_INT_RX_NO_BUFFER |
                     EMAC_INT_RX_STOPPED | EMAC_INT_PHY));

    if (status & EMAC_INT_ABNORMAL_INT) {
        EMACMSP432E4_private.abnormalInts++;
    }

    if (status & EMAC_INT_PHY) {
        EMACMSP432E4_processPhyInterrupt();
    }

    /* Process the transmit DMA list, freeing any buffers that have been
     * transmitted since our last interrupt.
     */
    if (status & EMAC_INT_TRANSMIT) {
        EMACMSP432E4_processTransmitted();
    }

    /*
     * Process the receive DMA list and pass all successfully received packets
     * up the stack.  We also call this function in cases where the receiver has
     * stalled due to missing buffers since the receive function will attempt to
     * allocate new pbufs for descriptor entries which have none.
     */
    if (status & (EMAC_INT_RECEIVE | EMAC_INT_RX_NO_BUFFER |
        EMAC_INT_RX_STOPPED)) {
        EMACMSP432E4_handleRx();
    }

    EMACIntEnable(EMAC0_BASE, (EMAC_INT_RECEIVE | EMAC_INT_TRANSMIT |
                        EMAC_INT_TX_STOPPED | EMAC_INT_RX_NO_BUFFER |
                        EMAC_INT_RX_STOPPED | EMAC_INT_PHY));
}

/*
 *  ======== EMACMSP432E4_emacStart ========
 *  The function is used to initialize and start the EMACMSP432E4
 *  controller and device.
 */
static int EMACMSP432E4_emacStart(struct NETIF_DEVICE* ptr_net_device)
{
    uint16_t value;
    EMACMSP432E4_HWAttrs const *hwAttrs = &EMACMSP432E4_hwAttrs;
    HwiP_Params hwiParams;
    ClockP_FreqHz freq;
    uint32_t ui32FlashConf, key;
    uint32_t pinMap;
    uint8_t  port;
    uint8_t  pin;
    bool enablePrefetch = false;

    /* set power dependency on peripherals being used */
    Power_setDependency(PowerMSP432E4_PERIPH_EMAC0);
    Power_setDependency(PowerMSP432E4_PERIPH_EPHY0);

    /* Configure the appropriate pins for ethernet led0 */
    pin = GPIOMSP432E4_getPinFromPinConfig(hwAttrs->led0Pin);
    port = GPIOMSP432E4_getPortFromPinConfig(hwAttrs->led0Pin);
    pinMap = GPIOMSP432E4_getPinMapFromPinConfig(hwAttrs->led0Pin);

    Power_setDependency(GPIOMSP432E4_getPowerResourceId(port));
    GPIOPinConfigure(pinMap);
    GPIOPinTypeEthernetLED(GPIOMSP432E4_getGpioBaseAddr(port), pin);

    /* Configure the appropriate pins for ethernet led1 */
    pin = GPIOMSP432E4_getPinFromPinConfig(hwAttrs->led1Pin);
    port = GPIOMSP432E4_getPortFromPinConfig(hwAttrs->led1Pin);
    pinMap = GPIOMSP432E4_getPinMapFromPinConfig(hwAttrs->led1Pin);

