energia/msp432e-core/system/source/ti/drivers/emac/EMACMSP432E4.c
    Power_setDependency(GPIOMSP432E4_getPowerResourceId(port));
    GPIOPinConfigure(pinMap);
    GPIOPinTypeEthernetLED(GPIOMSP432E4_getGpioBaseAddr(port), pin);

    ClockP_getCpuFreq(&freq);

    key = HwiP_disable();

    /*
     *  This is a work-around for the EMAC initialization issue found
     *  on the TM4C129 devices. This can be found in the silicon errata
     *  documentation spmz850g.pdf as ETH#02.
     *
     *  The following disables the flash pre-fetch (if it is not already
     *  disabled).
     */
    ui32FlashConf = FLASH_CTRL->CONF;
    if ((ui32FlashConf & (FLASH_CONF_FPFOFF)) == false) {
        enablePrefetch = true;
        ui32FlashConf &= ~(FLASH_CONF_FPFON);
        ui32FlashConf |= FLASH_CONF_FPFOFF;
        FLASH_CTRL->CONF = ui32FlashConf;
    }

    EMACPHYConfigSet(EMAC0_BASE, EMAC_PHY_CONFIG);

    EMACInit(EMAC0_BASE, freq.lo,
             EMAC_BCONFIG_MIXED_BURST | EMAC_BCONFIG_PRIORITY_FIXED, 4, 4, 0);

    /*
     *  Set MAC configuration options.
     *  EMAC_CONFIG_CHECKSUM_OFFLOAD is not enabled because the NDK does
     *  the checksum in software.
     */
    EMACConfigSet(EMAC0_BASE, (EMAC_CONFIG_FULL_DUPLEX |
                               EMAC_CONFIG_7BYTE_PREAMBLE |
                               EMAC_CONFIG_IF_GAP_96BITS |
                               EMAC_CONFIG_USE_MACADDR0 |
                               EMAC_CONFIG_SA_FROM_DESCRIPTOR |
                               EMAC_CONFIG_BO_LIMIT_1024),
                  (EMAC_MODE_RX_STORE_FORWARD |
                   EMAC_MODE_TX_STORE_FORWARD |
                   EMAC_MODE_TX_THRESHOLD_64_BYTES |
                   EMAC_MODE_RX_THRESHOLD_64_BYTES), 0);

    /* Program the MAC address into the Ethernet controller. */
    EMACAddrSet(EMAC0_BASE, 0, (uint8_t *)hwAttrs->macAddress);

    /* Initialize the DMA descriptors. */
    if (EMACMSP432E4_initDMADescriptors() < 0) {
        /*
         *  If fail to initialize DMA descriptor lists:
         *  1. Turns ON the prefetch buffer if it was disabled above
         *  2. call HwiP_restore
         *  3. call emacStop to clean up
         */
        if (enablePrefetch) {
            ui32FlashConf = FLASH_CTRL->CONF;
            ui32FlashConf &= ~(FLASH_CONF_FPFOFF);
            ui32FlashConf |= FLASH_CONF_FPFON;
            FLASH_CTRL->CONF = ui32FlashConf;
        }

        HwiP_restore(key);
        EMACMSP432E4_emacStop(ptr_net_device);

        return (-1);
    }

    /* Clear any stray PHY interrupts that may be set. */
    value = EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_MISR1);
    value = EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_MISR2);

    /* Configure and enable the link status change interrupt in the PHY. */
    value = EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_SCR);
    value |= (EPHY_SCR_INTEN_EXT | EPHY_SCR_INTOE_EXT);
    EMACPHYWrite(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_SCR, value);
    EMACPHYWrite(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_MISR1, (EPHY_MISR1_LINKSTATEN |
                 EPHY_MISR1_SPEEDEN | EPHY_MISR1_DUPLEXMEN | EPHY_MISR1_ANCEN));

    /* Read the PHY interrupt status to clear any stray events. */
    value = EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_MISR1);

    /*
     *  Set MAC filtering options.  We receive all broadcast and multicast
     *  packets along with those addressed specifically for us.
     */
    EMACFrameFilterSet(EMAC0_BASE, (EMAC_FRMFILTER_HASH_AND_PERFECT |
                       EMAC_FRMFILTER_PASS_MULTICAST));

    /* Clear any pending interrupts. */
    EMACIntClear(EMAC0_BASE, EMACIntStatus(EMAC0_BASE, false));

    /* Enable the Ethernet MAC transmitter and receiver. */
    EMACTxEnable(EMAC0_BASE);
    EMACRxEnable(EMAC0_BASE);

    /* Enable the Ethernet RX and TX interrupt source. */
    EMACIntEnable(EMAC0_BASE, (EMAC_INT_RECEIVE | EMAC_INT_TRANSMIT |
                  EMAC_INT_TX_STOPPED | EMAC_INT_RX_NO_BUFFER |
                  EMAC_INT_RX_STOPPED | EMAC_INT_PHY));

    EMACPHYWrite(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_BMCR, (EPHY_BMCR_ANEN |
                 EPHY_BMCR_RESTARTAN));

    /*
     * Turns ON the prefetch buffer if it was disabled above
     */
    if (enablePrefetch) {
        ui32FlashConf = FLASH_CTRL->CONF;
        ui32FlashConf &= ~(FLASH_CONF_FPFOFF);
        ui32FlashConf |= FLASH_CONF_FPFON;
        FLASH_CTRL->CONF = ui32FlashConf;
    }

    HwiP_restore(key);

    /* Create the hardware interrupt */
    HwiP_Params_init(&hwiParams);
    hwiParams.priority = hwAttrs->intPriority;

    EMACMSP432E4_private.hwi = HwiP_create(hwAttrs->intNum,
                                   EMACMSP432E4_hwiIntFxn,
                                   &hwiParams);

    if (EMACMSP432E4_private.hwi == NULL) {
        EMACMSP432E4_emacStop(ptr_net_device);
        return (-1);
    }

    return (0);
}

/*
 *  ======== EMACMSP432E4_emacStop ========
 *  The function is used to de-initialize and stop the EMACMSP432E4
 *  controller and device.
 */
static int EMACMSP432E4_emacStop(struct NETIF_DEVICE* ptr_net_device)
{
    EMACMSP432E4_HWAttrs const *hwAttrs = &EMACMSP432E4_hwAttrs;
    PBM_Handle hPkt;
    uint8_t  port;

    int i = 0;

    EMACIntDisable(EMAC0_BASE, (EMAC_INT_RECEIVE | EMAC_INT_TRANSMIT |
                     EMAC_INT_TX_STOPPED | EMAC_INT_RX_NO_BUFFER |
                     EMAC_INT_RX_STOPPED | EMAC_INT_PHY));

    if (EMACMSP432E4_private.hwi != NULL) {
        HwiP_delete(EMACMSP432E4_private.hwi);
    }

    while (PBMQ_count(&EMACMSP432E4_private.PBMQ_rx)) {
        /* Dequeue a packet from the driver receive queue. */
        hPkt = PBMQ_deq(&EMACMSP432E4_private.PBMQ_rx);
        PBM_free(hPkt);
    }

    while (PBMQ_count(&EMACMSP432E4_private.PBMQ_tx)) {
        /* Dequeue a packet from the driver receive queue. */
        hPkt = PBMQ_deq(&EMACMSP432E4_private.PBMQ_tx);
        PBM_free(hPkt);
    }

    for (i = 0; i < NUM_RX_DESCRIPTORS; i++) {
        if (g_pRxDescriptors[i].hPkt != NULL) {
            PBM_free(g_pRxDescriptors[i].hPkt);
        }
    }

    GPIOMSP432E4_undoPinConfig(hwAttrs->led0Pin);
    port = GPIOMSP432E4_getPortFromPinConfig(hwAttrs->led0Pin);
    Power_releaseDependency(GPIOMSP432E4_getPowerResourceId(port));

