energia/msp432e-core/system/source/ti/drivers/emac/EMACMSP432E4.c
    GPIOMSP432E4_undoPinConfig(hwAttrs->led1Pin);
    port = GPIOMSP432E4_getPortFromPinConfig(hwAttrs->led1Pin);
    Power_releaseDependency(GPIOMSP432E4_getPowerResourceId(port));

    Power_releaseDependency(PowerMSP432E4_PERIPH_EPHY0);
    Power_releaseDependency(PowerMSP432E4_PERIPH_EMAC0);

    return (0);
}

/*
 *  ======== EMACMSP432E4_emacPoll ========
 *  The function is used to poll the EMACMSP432E4 controller to check
 *  if there has been any activity
 */
static void EMACMSP432E4_emacPoll(struct NETIF_DEVICE* ptr_net_device,
        uint32_t timer_tick)
{
    uint32_t newLinkStatus;

    /* Send pending Tx packets */
    EMACMSP432E4_processPendingTx();

    /* Check link status */
    newLinkStatus =
            (EMACPHYRead(EMAC0_BASE, 0, EPHY_BMSR) & EPHY_BMSR_LINKSTAT);

    /* Signal the stack if link status changed */
    if (newLinkStatus != EMACMSP432E4_private.linkUp) {
        signalLinkChange(EMACMSP432E4_private.hEvent, newLinkStatus, 0);
    }

    /* Set the link status */
    EMACMSP432E4_private.linkUp = newLinkStatus;
}

/*
 *  ======== EMACMSP432E4_emacSend ========
 *  The function is the interface routine invoked by the NDK stack to
 *  pass packets to the driver.
 */
static int EMACMSP432E4_emacSend(struct NETIF_DEVICE* ptr_net_device, PBM_Handle hPkt)
{
    /*
     *  Enqueue the packet onto the end of the transmit queue.
     *  This is done to ensure that the packets are sent in order.
     */
    PBMQ_enq(&EMACMSP432E4_private.PBMQ_tx, hPkt);

    /* Transmit pending packets */
    EMACMSP432E4_processPendingTx();

    return (0);
}

/*
 *  ======== EMACMSP432E4_emacioctl ========
 *  The function is called by the NDK core stack to configure the driver
 */
static int EMACMSP432E4_emacioctl(struct NETIF_DEVICE* ptr_net_device,
        uint32_t cmd, void* pbuf, uint32_t size)
{
    int retval;

    switch (cmd) {
        case NIMU_ADD_MULTICAST_ADDRESS:
        case NIMU_DEL_MULTICAST_ADDRESS:
            retval = 0;
            break;

        case NIMU_GET_DEVICE_ISLINKUP:
            if (size >= sizeof(uint32_t)) {
                if (EMACMSP432E4_isLinkUp()) {
                    *(uint32_t *)pbuf = 1;
                }
                else {
                    *(uint32_t *)pbuf = 0;
                }
                retval = 0;
            }
            else {
                /* user-provided buffer is too small */
                retval = -(EINVAL);
            }

            break;

        default:
            retval = -(EINVAL);
            break;
    }

    return (retval);
}

/*
 *  ======== EMACMSP432E4_pkt_service ========
 *  The function is called by the NDK core stack to receive any packets
 *  from the driver.
 */
static void EMACMSP432E4_pkt_service(NETIF_DEVICE* ptr_net_device)
{
    PBM_Handle  hPkt;

    /* Give all queued packets to the stack */
    while (PBMQ_count(&EMACMSP432E4_private.PBMQ_rx)) {

        /* Dequeue a packet from the driver receive queue. */
        hPkt = PBMQ_deq(&EMACMSP432E4_private.PBMQ_rx);

        /*
         *  Prepare the packet so that it can be passed up the networking stack.
         *  If this 'step' is not done the fields in the packet are not correct
         *  and the packet will eventually be dropped.
         */
        PBM_setIFRx(hPkt, ptr_net_device);

        /* Pass the packet to the NDK Core stack. */
        NIMUReceivePacket(hPkt);
    }

    /* Work has been completed; the receive queue is empty. */
    return;
}

/*
 *  ======== EMACMSP432E4_initDMADescriptors ========
 * Initialize the transmit and receive DMA descriptor lists.
 */
static int EMACMSP432E4_initDMADescriptors(void)
{
    int32_t     i;
    PBM_Handle  hPkt;

    /* Transmit list -  mark all descriptors as not owned by the hardware */
    for (i = 0; i < NUM_TX_DESCRIPTORS; i++) {
        g_pTxDescriptors[i].hPkt = NULL;
        g_pTxDescriptors[i].Desc.ui32Count = 0;
        g_pTxDescriptors[i].Desc.pvBuffer1 = 0;
        g_pTxDescriptors[i].Desc.DES3.pLink = ((i == (NUM_TX_DESCRIPTORS - 1)) ?
               &g_pTxDescriptors[0].Desc : &g_pTxDescriptors[i + 1].Desc);
        g_pTxDescriptors[i].Desc.ui32CtrlStatus = DES0_TX_CTRL_INTERRUPT |
                /*DES0_TX_CTRL_IP_ALL_CKHSUMS |*/
                DES0_TX_CTRL_CHAINED;
    }

    /*
     * Receive list - tag each descriptor with a buffer and set all fields to
     * allow packets to be received.
     */
    for (i = 0; i < NUM_RX_DESCRIPTORS; i++) {
        hPkt = PBM_alloc(RX_BUFFER_SIZE);
        if (hPkt) {
            EMACMSP432E4_primeRx(hPkt, &(g_pRxDescriptors[i]));
        }
        else {
            /*
             *  This is a failing scenario return -1.
             *  emacStop will do the PBM_free for any allocated packet.
             */
            g_pRxDescriptors[i].Desc.pvBuffer1 = 0;
            g_pRxDescriptors[i].Desc.ui32CtrlStatus = 0;
            return (-1);
        }
        g_pRxDescriptors[i].Desc.DES3.pLink =
                ((i == (NUM_RX_DESCRIPTORS - 1)) ?
                &g_pRxDescriptors[0].Desc : &g_pRxDescriptors[i + 1].Desc);
    }

    /* Set the descriptor pointers in the hardware. */
    EMACRxDMADescriptorListSet(EMAC0_BASE, &g_pRxDescriptors[0].Desc);
    EMACTxDMADescriptorListSet(EMAC0_BASE, &g_pTxDescriptors[0].Desc);

    return (0);
}

/*
 *  ======== EMACMSP432E4_NIMUInit ========
 *  The function is used to initialize and register the EMACMSP432E4
 *  with the Network Interface Management Unit (NIMU)
 */
int EMACMSP432E4_NIMUInit(STKEVENT_Handle hEvent)
{
    EMACMSP432E4_HWAttrs const *hwAttrs = &EMACMSP432E4_hwAttrs;
    NETIF_DEVICE *device;
    uint32_t ulUser0, ulUser1;

    if (hwAttrs->macAddress[0] == 0xff && hwAttrs->macAddress[1] == 0xff &&
        hwAttrs->macAddress[2] == 0xff && hwAttrs->macAddress[3] == 0xff &&
        hwAttrs->macAddress[4] == 0xff && hwAttrs->macAddress[5] == 0xff) {

        /* Get the MAC address from flash */
        FlashUserGet(&ulUser0, &ulUser1);
        if ((ulUser0 != 0xffffffff) && (ulUser1 != 0xffffffff)) {
            /*
             *  Convert the 24/24 split MAC address from NV ram into a 32/16
             *  split MAC address needed to program the hardware registers, then
             *  program the MAC address into the Ethernet Controller registers.
             */
            hwAttrs->macAddress[0] = ((ulUser0 >>  0) & 0xff);
            hwAttrs->macAddress[1] = ((ulUser0 >>  8) & 0xff);
            hwAttrs->macAddress[2] = ((ulUser0 >> 16) & 0xff);
            hwAttrs->macAddress[3] = ((ulUser1 >>  0) & 0xff);
            hwAttrs->macAddress[4] = ((ulUser1 >>  8) & 0xff);
            hwAttrs->macAddress[5] = ((ulUser1 >> 16) & 0xff);
        }
        else {
            /* MAC address was not specified */
            return (-1);
        }
    } /* else, use the MAC address set by the user in board.c  */

    /* Initialize the global structures */
    memset(&EMACMSP432E4_private, 0, sizeof(EMACMSP432E4_Data));

    /* Allocate memory for the EMAC. Memory freed in the NDK stack shutdown */
    device = mmAlloc(sizeof(NETIF_DEVICE));
    if (device == NULL) {
        return (-1);
    }

