energia/msp432e-core/system/source/ti/drivers/emac/EMACMSP432E4.c
    /* Initialize the allocated memory block. */
    mmZeroInit(device, sizeof(NETIF_DEVICE));

    device->mac_address[0] = hwAttrs->macAddress[0];
    device->mac_address[1] = hwAttrs->macAddress[1];
    device->mac_address[2] = hwAttrs->macAddress[2];
    device->mac_address[3] = hwAttrs->macAddress[3];
    device->mac_address[4] = hwAttrs->macAddress[4];
    device->mac_address[5] = hwAttrs->macAddress[5];

    /* Initialize the Packet Device Information struct */
    PBMQ_init(&EMACMSP432E4_private.PBMQ_rx);
    PBMQ_init(&EMACMSP432E4_private.PBMQ_tx);
    EMACMSP432E4_private.hEvent       = hEvent;
    EMACMSP432E4_private.pTxDescList  = &g_TxDescList;
    EMACMSP432E4_private.pRxDescList  = &g_RxDescList;
    EMACMSP432E4_private.rxCount      = 0;
    EMACMSP432E4_private.rxDropped    = 0;
    EMACMSP432E4_private.txSent       = 0;
    EMACMSP432E4_private.txDropped    = 0;
    EMACMSP432E4_private.abnormalInts = 0;
    EMACMSP432E4_private.isrCount = 0;
    EMACMSP432E4_private.linkUp       = false;

    /* Populate the Network Interface Object. */
    strcpy(device->name, ETHERNET_NAME);
    device->mtu         = ETH_MAX_PAYLOAD - ETHHDR_SIZE;
    device->pvt_data    = (void *)&EMACMSP432E4_private;

    /* Populate the Driver Interface Functions. */
    device->start       = EMACMSP432E4_emacStart;
    device->stop        = EMACMSP432E4_emacStop;
    device->poll        = EMACMSP432E4_emacPoll;
    device->send        = EMACMSP432E4_emacSend;
    device->pkt_service = EMACMSP432E4_pkt_service;
    device->ioctl       = EMACMSP432E4_emacioctl;
    device->add_header  = NIMUAddEthernetHeader;

    /* Register the device with NIMU */
    if (NIMURegister(device) < 0) {
        return (-1);
    }

    return (0);
}

/*
 *  ======== EMACMSP432E4_linkUp ========
 */
bool EMACMSP432E4_isLinkUp()
{
    uint32_t newLinkStatus;

    /* Check link status */
    newLinkStatus =
            (EMACPHYRead(EMAC0_BASE, 0, EPHY_BMSR) & EPHY_BMSR_LINKSTAT);

    /* Signal the stack if link status changed */
    if (newLinkStatus != EMACMSP432E4_private.linkUp) {
        signalLinkChange(EMACMSP432E4_private.hEvent, newLinkStatus, 0);
    }

    /* Set the link status */
    EMACMSP432E4_private.linkUp = newLinkStatus;

    if (EMACMSP432E4_private.linkUp) {
        return (true);
    }
    else {
        return (false);
    }
}
